frontend/controllers/ContentController.php

SELECT * FROM `main_pages` WHERE `url`='calc'
SELECT * FROM `articles` WHERE `page`='calc'
---
    public function actionIndex(){
        $url = Yii::$app->request->get('url');
        $content = Content::find()->where(['url' => $url])->all();
        $article = Articles::find()->where(['page' => $url])->all();

SELECT * FROM `articles` WHERE `url`='mission'
---
     public function actionView(){
        $url = Yii::$app->request->get('page');
        $url_p = Yii::$app->request->get('url');

        $articles = Articles::find()->where(['url' => $url])->all();