backend/modules/articles/controllers/DefaultController.php

SELECT * FROM `articles` WHERE `id`='28'
---
    protected function findModel($id)
    {
        if (($model = Articles::findOne($id)) !== null) {