frontend/views/content/index.php

SELECT * FROM `news`
SELECT * FROM `markets_news`
SELECT * FROM `articles` WHERE `page`='calc'
---
use frontend\models\News;
use frontend\models\MarketsNews;

$news = News::find()->all();
$markets = MarketsNews::find()->all();
$articles = Articles::find()->where(['page' => $content[0]['url']])->asArray()->all();