backend/modules/articles/views/default/_form.php

SELECT `name`, `url` FROM `main_pages`
---


$main = new MainPages();
$names = MainPages::find()->select(['name', 'url'])->all();