frontend/views/site/index.php

SELECT * FROM `gas_s`
---
use frontend\models\Mazut;
use frontend\models\Bitum;

$gas_s = GasS::find()->all();

SELECT * FROM `news`
SELECT * FROM `markets_news`
---
$persent = (end($values) -$values[0]) / $values[0] * 100;


$news = News::find()->all();
$markets = MarketsNews::find()->all();